# Mod13 Handling Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.__version__

'1.18.2'

In [3]:
pd.__version__

'1.0.3'

### None & NAN

In [13]:
data = pd.Series([1, np.nan, 3, None]); data

array([1, nan, 3, None], dtype=object)

In [14]:
# None can only exist in 'object' array
data = pd.Series([1, np.nan, 'hello', None]);data

0        1
1      NaN
2    hello
3     None
dtype: object

### Detecting null values

In [6]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [7]:
# Masking 
data[data.notnull()]

0        1
2    hello
dtype: object

In [9]:
%timeit d2.isnull().any()

62.5 µs ± 479 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [10]:
%timeit d2.isnull().values.any()

40 µs ± 227 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

### Dropping null values

For a ``Series``

In [11]:
data.dropna()

0        1
2    hello
dtype: object

For a ``DataFrame``

In [2]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

By default, ``dropna()`` will drop all rows in which *any* null value is present:

In [3]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [5]:
# df.dropna(axis='columns')
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [15]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [8]:
df.dropna(axis=1, how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [10]:
df.dropna(axis=0, thresh=3)

     0    1  2
1  2.0  3.0  5

### Filling null values

#### For ``Series``

Masking style

In [18]:
d1 = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
d1

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [19]:
d1.isnull()

a    False
b     True
c    False
d     True
e    False
dtype: bool

In [20]:
d1[d1.isnull()]=0
d1

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

fill NA entries with a single value, such as zero:

In [21]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [22]:
# fill with zero
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [23]:
# fill with mean
data.fillna(data.mean())

a    1.0
b    2.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [24]:
# fill with median
data.fillna(data.median())

a    1.0
b    2.0
c    2.0
d    2.0
e    3.0
dtype: float64

specify a forward-fill to propagate the previous value forward:

In [25]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [26]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

#### For ``DataFrame``

In [27]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [29]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [30]:
df.fillna(method='ffill')

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

## Lab

<b>有一個 DataFrame df，試著計算空值個數有幾個?</b>

In [ ]:
arr = np.array([[ 8.,  2., 17., 20., 10.],
       [ 4., np.nan,  3., np.nan,  2.],
       [24., 26., 14., 23., 21.],
       [ 7., 29.,  3., 19., 25.],
       [14., 24., np.nan, 21., 10.],
       [np.nan, np.nan, 20., 26., np.nan]])

df = pd.DataFrame(arr, columns=['one', 'two', 'three', 'four', 'five'])
df

In [ ]:
df.values

<b>試著將有空值的列拋棄</b>

<b>試著將空值超過一個以上的列拋棄</b>